#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/icici-bank/tfe-git-action/runs/run-h4ijH4PQbUinM9Kr

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloud_bucket["learn-gcpdevops-987654764gdfw-gcs-01"].google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = {
          + "app" = "gcs"
          + "env" = "uat"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "learn-gcpdevops-987654764gdfw-gcs-01"
      + project                     = "icici-terraform-svc-now"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 3
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      + logging {
          + log_bucket        = "log-bucket"
          + log_object_prefix = (known after apply)
        }

      + versioning {
          + enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_id        = [
      + (known after apply),
    ]
  + bucket_name      = [
      + "learn-gcpdevops-987654764gdfw-gcs-01",
    ]
  + bucket_self_link = [
      + (known after apply),
    ]
  + bucket_url       = [
      + (known after apply),
    ]

```

</details>

*Pusher: @Adarsh-Suvarna, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*